#### Задача: Подсчёт силы строчки

Напишите программу, которая запрашивает у пользователя произвольную строку (текст) и подсчитывает количество очков по следующим правилам:

1. Если символ строки является цифрой от `0` до `9`, то к общему результату прибавляется числовое значение этой цифры.
2. Если символ является **не** цифрой (буква, пробел, знак препинания и т.д.), то из общего результата вычитается `1`.

**Требования к программе:**
1. Программа должна запрашивать у пользователя строку с помощью `input()`.
2. Обрабатывать каждый символ строки по порядку.
3. Выводить итоговый счёт.

**Примеры работы программы:**

Пример 1:
```
Введите текст: a1b2c3
Результат: 3
```
*Пояснение:* a(-1) + 1(1) + b(-1) + 2(2) + c(-1) + 3(3) = 3

Пример 2:
```
Введите текст: hello
Результат: -5
```
*Пояснение:* 5 символов, не являющихся цифрами: 5 × (-1) = -5

**Примечания:**
- Пустая строка должна давать результат `0`
- Учитываются абсолютно все символы: буквы, пробелы, знаки препинания, спецсимволы
- Цифры обрабатываются как отдельные символы, не как части чисел

---

**Подсказки по реализации:**

1. **Получение ввода:** Используйте `input()` для получения строки от пользователя.
2. **Инициализация счётчика:** Создайте переменную (например, `score`) для хранения суммы очков, начиная с 0.
3. **Цикл по символам:** Используйте цикл `for` для перебора каждого символа строки:
   ```python
   for char in text:
       # обрабатываем каждый символ char
   ```
4. **Проверка на цифру:** Используйте метод строк `.isdigit()` или сравнение с диапазоном символов `'0'` до `'9'`.
```python
   if char.isdigit():      # Метод проверяет, цифра ли символ
   if '0' <= char <= '9':  # Проверяем, находится ли символ между '0' и '9'
```
1. **Преобразование цифры в число:** Если символ - цифра, преобразуйте его в целое число с помощью `int()`.
2. **Подсчёт очков:** В зависимости от результата проверки добавляйте или вычитайте очки.
3. **Вывод результата:** Используйте `print()` для вывода итогового счёта.

**Алгоритмический план:**
- Начать с `score = 0`
- Для каждого символа в строке:
  - Если символ - цифра: `score += int(символ)`
  - Иначе: `score -= 1`
- Вывести `score`