
# Задача «Шифр с динамическим сдвигом по ключу»

Вам нужно создать программу для шифрования и дешифрования сообщений. Каждая буква текста сдвигается на величину, определяемую ключом. **Регистр букв игнорируется**, а **сдвиг ограничивается остатком от деления на 64**, чтобы символы оставались в пределах печатного диапазона.

## Задание

Напишите две функции:

1. **Шифратор:** `encrypt(text, key)` — принимает исходный текст и ключ, возвращает зашифрованный текст.
2. **Дешифратор:** `decrypt(encrypted_text, key)` — принимает зашифрованный текст и ключ, возвращает исходный текст.

## Правила шифрования/дешифрования

1. **Каждая буква** в тексте (только латинские буквы A-Z, a-z) сдвигается на определённое число позиций в таблице Unicode.
2. Величина сдвига для текущей буквы определяется с помощью функции `ord()` от соответствующей буквы ключа:  
   `сдвиг = ord(буква_ключа) % 64`
   
   То есть берём код символа ключа и берём остаток от деления на 64 — это число и будет сдвигом (от 0 до 63).

3. Ключ применяется **циклически**: когда ключ заканчивается, мы начинаем с его первой буквы снова.

4. **Сдвиг применяется к коду символа**:  
   `новый_код = (ord(буква_текста) + сдвиг) % 128` — для шифрования  
   `новый_код = (ord(буква_текста) - сдвиг) % 128` — для дешифрования
   
   *Почему 128?* Диапазон 0–127 охватывает все основные символы ASCII, включая латиницу, знаки препинания и управляющие символы. Это гарантирует, что результат останется в пределах ASCII.

5. **Небуквенные символы** (пробелы, знаки препинания, цифры) остаются без изменений и **не влияют на сдвиг** (ключ для них не тратится).

## Входные данные

- `text` / `encrypted_text` — строка, содержащая латинские буквы (A-Z, a-z) и любые другие символы.
- `key` — строка, содержащая любые символы (минимум 1 символ).

## Выходные данные

- Зашифрованная или расшифрованная строка (String).

## Примеры работы

**Пример 1: Шифрование**
```
>>> encrypt("Hello", "key")
'=LlV'
```

**Пример 2: Дешифрование**
```
>>> decrypt("=LlV", "key")
'Hello'
```

**Пример 3: Шифрование с небуквенными символами**
```
>>> encrypt("Hello, World!", "code")
'=LlV,;ZRkP!'
```

**Пример 4: Дешифрование**
```
>>> decrypt("=LlV,;ZRkP!", "code")
'Hello, World!'
```

**Пример 5: Ключ с разными символами**
```
>>> encrypt("abc", "!@#")
'LMN'
>>> decrypt("LMN", "!@#")
'abc'

```

## Подсказки

- **Определение сдвига по ключу:**
  ```python
  shift = ord(key_char) % 64
  ```

- **Применение сдвига:**
  ```python
  # Для шифрования
  new_code = (ord(char) + shift) % 128
  new_char = chr(new_code)
  
  # Для дешифрования
  new_code = (ord(char) - shift) % 128
  new_char = chr(new_code)
  ```

- **Циклическое использование ключа:**
  ```python
  key_index = 0
  for char in text:
      if char.isalpha():
          current_shift = ord(key[key_index % len(key)]) % 64
          key_index += 1
          # применяем сдвиг к char
          result += chr((ord(char) + current_shift) % 128)
      else:
          result += char
  ```

- **Для дешифрования** используем ту же логику, но с вычитанием сдвига.

## Проверка себя

```python
# Тест 1: базовый тест
text = "Hello, World!"
key = "secret"
encrypted = encrypt(text, key)
decrypted = decrypt(encrypted, key)
print(f"Исходный: {text}")
print(f"Зашифрованный: {encrypted}")
print(f"Расшифрованный: {decrypted}")
print(f"Совпадает: {text == decrypted}")

# Тест 2: ключ с небуквенными символами
print(encrypt("abc", "!@#"))
print(decrypt("LMN", "!@#"))

# Тест 3: пустой текст
print(encrypt("", "key"))  # должно вернуть ""

# Тест 4: длинный ключ
print(encrypt("Hello", "verylongkeythatwrapsaround"))
print(decrypt(encrypt("Hello", "verylongkeythatwrapsaround"), "verylongkeythatwrapsaround"))
```