## 📚 ДЗ

## прочитайте и повторите перед выполнением  

[Python Словари](https://github.com/RestartLexinus/SchoolMD/blob/main/Python/Теория/006_Python_Словари.md)     
[Python Циклы](https://github.com/RestartLexinus/SchoolMD/blob/main/Python/Теория/003_Python_Циклы.md)        

---

## 📝 **Условие задачи:**

Напишите программу на Python, которая создает электронную библиотеку книг. Программа должна:

### **Основные требования:**
1. ✅ Создать пустой словарь для хранения книг
2. ✅ В цикле **5 раз** запросить у пользователя данные о книге:
   - Название книги
   - Количество страниц в книге
3. ✅ Сохранять каждую книгу в словаре в формате:  
   `"название книги": количество_страниц`
4. ✅ После ввода всех книг вывести на экран:
   - Красивый заголовок
   - Список всех книг с их данными

---

## 🖥️ **Пример работы программы:**

```
╔══════════════════════════════════════╗
║     СОЗДАНИЕ ЭЛЕКТРОННОЙ БИБЛИОТЕКИ  ║
╚══════════════════════════════════════╝

Введите информацию о 5 книгах:

📘 КНИГА 1:
   Название: Гарри Поттер и философский камень
   Страниц: 350

📘 КНИГА 2:
   Название: Маленький принц
   Страниц: 96

... (ещё 3 книги) ...

════════════════════════════════════════
        ВАША БИБЛИОТЕКА СОЗДАНА!        
════════════════════════════════════════

📚 СОДЕРЖАНИЕ БИБЛИОТЕКИ:

1. «Гарри Поттер и философский камень» — 350 страниц
2. «Маленький принц» — 96 страниц
3. «1984» — 320 страниц
4. «Колобок» — 15 страниц
5. «Преступление и наказание» — 672 страниц
```

---

## 💡 **Что нужно знать для выполнения:**

### **Необходимые элементы Python:**
1. **Словари (dict)** - `my_dict = {}`, `my_dict[key] = value`
2. **Цикл for** - `for i in range(5):`
3. **Функция input()** - для ввода данных
4. **Функция int()** - для преобразования строки в число
5. **Методы словаря** - `.items()`, `.values()`

### **Базовый алгоритм:**
```
1. Создать пустой словарь
2. Повторить 5 раз:
   - Спросить название книги
   - Спросить количество страниц
   - Добавить в словарь
3. Вывести заголовок
4. Вывести все книги из словаря
```


---

### **Заготовка**

```python
# 📚 СОЗДАНИЕ БИБЛИОТЕКИ КНИГ
# ===============================

# 1. СОЗДАЕМ ПУСТОЙ СЛОВАРЬ ДЛЯ БИБЛИОТЕКИ
# библиотека = {}

# 2. ЦИКЛ ДЛЯ ВВОДА 5 КНИГ
# for i in range(5):
#     название = input("Введите название книги: ")
#     страницы = int(input("Введите количество страниц: "))
#     библиотека[название] = страницы

# 3. КРАСИВЫЙ ВЫВОД РЕЗУЛЬТАТА (ЭТУ ЧАСТЬ НУЖНО НАПИСАТЬ)
print("\n" + "═" * 50)
print("📚 ВАША БИБЛИОТЕКА УСПЕШНО СОЗДАНА!")
print("═" * 50)

# Здесь нужно вывести все книги из словаря 'библиотека'
# Используй цикл for для перебора элементов словаря
# Пример: for название, страницы in библиотека.items():
# Нумеруй книги, начиная с 1

print("\n📖 СПИСОК КНИГ В БИБЛИОТЕКЕ:")
print("-" * 40)

# ==============================================
# НАЧАЛО ТВОЕГО КОДА ДЛЯ ВЫВОДА КНИГ:
# ==============================================

# 1. Создай переменную для номера книги (начни с 1)
# номер = 1

# 2. Создай цикл for для перебора всех книг в словаре
#    Используй метод .items() для получения пар "название: страницы"
#    for название, страницы in библиотека.items():

# 3. Внутри цикла выведи информацию о книге:
#    print(f"{номер}. «{название}» — {страницы} страниц")

# 4. Увеличь номер на 1 для следующей книги

# ==============================================
# КОНЕЦ ТВОЕГО КОДА ДЛЯ ВЫВОДА КНИГ
# ==============================================
```